---
kind: type
id: T:Autodesk.Revit.DB.Visual.GradientInterpolationType
source: html/ce9e1d57-a7cb-137d-ed6c-4250b4167399.htm
---
# Autodesk.Revit.DB.Visual.GradientInterpolationType

The enumerated type representing the permitted values for the asset property "GradientInterpolation" from the "Gradient" schema.

## Syntax (C#)
```csharp
public enum GradientInterpolationType
```